# Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.

# Формат входных данных
# На вход программе подается одно целое число.

# Формат выходных данных
# Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.

# put your python code here
num1 = int(input())
print(num1)
num2 = num1 + 1
print(num2)
num3 = num2 + 1
print(num3)
