# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

# Формат входных данных
# На вход программе подаётся три целых числа, каждое на отдельной строке.

# Формат выходных данных
# Программа должна вывести сумму введенных чисел.

# put your python code here
num1 = int(input())
num2 = int(input())
num3 = int(input())
print(num1 + num2 + num3)
