# 451 градус по Фаренгейту 
# У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». 
# Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

# put your python code here
F = float(input())
C = (5 / 9) * (F - 32)
print(C)
