# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

# Примечание. Высота и ширина прямоугольника равны 44 и 1717 звёздочкам соответственно.


# put your python code here
print("*****************")
print("*", "             ", "*")
print("*", "             ", "*")
print("*****************")
