# Принадлежность 1
# Напишите программу, которая принимает целое число xx и определяет, принадлежит ли данное число указанному промежутку. 

# Формат входных данных
# На вход программе подаётся целое число xx.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.


# put your python code here
num = int(input())
if num >-1 and num < 17:
    print("Принадлежит")
else:
    print("Не принадлежит")
