# олько + 🌶️
# Напишите программу, которая считывает три числа и подсчитывает сумму только положительных чисел.

# Формат входных данных
# На вход программе подаются три целых числа.

# Формат выходных данных
# Программа должна вывести одно число – сумму положительных чисел.

# Примечание. Если положительных чисел нет, то следует вывести 00.


# put your python code here
a = int(input())
b = int(input())
c = int(input())
d = int()
d = 0
if a > 0:
    d = d + a
if b > 0:
    d = d + b
if c > 0:
    d = d + c
print(d)
