# Футбольная команда
# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:

# «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».

# Формат входных данных
# На вход программе подаётся строка – название футбольной команды.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.


# put your python code here
c = input()
print(f"Футбольная команда {c} имеет длину", len(c), "символов")
